In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'kor':[80,30,50,70],'eng':[20,90,90,80],'math':[33,44,55,66]}
df = pd.DataFrame(data,index=['aa','bb','cc','dd'])
df

    kor  eng  math
aa   80   20    33
bb   30   90    44
cc   50   90    55
dd   70   80    66

### 데이터프레임 멤버함수

In [3]:
# df.rename() => 컬럼 이름 변경
# 딕셔너리 형식으로 적용 // key는 기존 컬럼명 : value는 새로운 컬럼 이름
df.rename(columns={'kor':'국어','eng':'영어'},inplace=True)
df

    국어  영어  math
aa  80  20    33
bb  30  90    44
cc  50  90    55
dd  70  80    66

In [6]:
# df.rename(index or column = dictionary) => 인덱스 이름 변경
# 딕셔너리 형식으로 적용 // key는 기존 컬럼명 : value는 새로운 컬럼 이름
df.rename(index={'aa':'홍길동','cc':'임꺽정'},inplace=True)
df

     국어  영어  math
홍길동  80  20    33
bb   30  90    44
임꺽정  50  90    55
dd   70  80    66

In [9]:
# df.reset_index() => 기존 인덱스는 컬럼을 들어가고 zero-based로 새로운 인덱스가
# 들어간다.
df.reset_index(inplace=True)

In [10]:
df

  index  국어  영어  math
0   홍길동  80  20    33
1    bb  30  90    44
2   임꺽정  50  90    55
3    dd  70  80    66

In [11]:
# df.set_index(column)=> 특정 컬럼을 인덱스로 변경하기
df.set_index('math')

     index  국어  영어
math
33     홍길동  80  20
44      bb  30  90
55     임꺽정  50  90
66      dd  70  80